Revit 2024 API
CompoundStructure.CreateSingleLayerCompoundStructure Method (MaterialFunctionAssignment, Double, ElementId)
 Creates a CompoundStructure containing a single layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static CompoundStructure CreateSingleLayerCompoundStructure(
	MaterialFunctionAssignment layerFunction,
	double width,
	ElementId materialId
)
Visual Basic
Public Shared Function CreateSingleLayerCompoundStructure ( _
	layerFunction As MaterialFunctionAssignment, _
	width As Double, _
	materialId As ElementId _
) As CompoundStructure
Visual C++
public:
static CompoundStructure^ CreateSingleLayerCompoundStructure(
	MaterialFunctionAssignment layerFunction,
	double width,
	ElementId^ materialId
)
Parameters
layerFunction
Type: Autodesk.Revit.DB.MaterialFunctionAssignment
 The function of the single layer.
width
Type: System.Double
 The width of the single layer.
materialId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the material for the single layer.
Return Value
 The newly created compound structure.
Remarks
 It is not verified that materialId corresponds to a valid Material element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for width must be greater than 0 and no more than 30000 feet. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
CompoundStructure Class
CreateSingleLayerCompoundStructure Overload
Autodesk.Revit.DB Namespace